<a href="https://colab.research.google.com/github/Charanmaloth/DS-Project2-Python/blob/main/Datasheet_1_%26_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
!git clone https://github.com/Charanmaloth/DS-Project2-Python.git

fatal: destination path 'DS-Project2-Python' already exists and is not an empty directory.

In [3]:
!pip install geopandas

Requirement already satisfied: geopandas in /usr/local/lib/python3.10/dist-packages (0.13.2)
Requirement already satisfied: fiona>=1.8.19 in /usr/local/lib/python3.10/dist-packages (from geopandas) (1.9.6)
Requirement already satisfied: packaging in /usr/local/lib/python3.10/dist-packages (from geopandas) (24.1)
Requirement already satisfied: pandas>=1.1.0 in /usr/local/lib/python3.10/dist-packages (from geopandas) (2.0.3)
Requirement already satisfied: pyproj>=3.0.1 in /usr/local/lib/python3.10/dist-packages (from geopandas) (3.6.1)
Requirement already satisfied: shapely>=1.7.1 in /usr/local/lib/python3.10/dist-packages (from geopandas) (2.0.4)
Requirement already satisfied: attrs>=19.2.0 in /usr/local/lib/python3.10/dist-packages (from fiona>=1.8.19->geopandas) (23.2.0)
Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from fiona>=1.8.19->geopandas) (2024.6.2)
Requirement already satisfied: click~=8.0 in /usr/local/lib/python3.10/dist-packages (from fiona>=1.8.19->geopandas) (8.1.7)
Requirement already satisfied: click-plugins>=1.0 in /usr/local/lib/python3.10/dist-packages (from fiona>=1.8.19->geopandas) (1.1.1)
Requirement already satisfied: cligj>=0.5 in /usr/local/lib/python3.10/dist-packages (from fiona>=1.8.19->geopandas) (0.7.2)
Requirement already satisfied: six in /usr/local/lib/python3.10/dist-packages (from fiona>=1.8.19->geopandas) (1.16.0)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas>=1.1.0->geopandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas>=1.1.0->geopandas) (2023.4)
Requirement already satisfied: tzdata>=2022.1 in /usr/local/lib/python3.10/dist-packages (from pandas>=1.1.0->geopandas) (2024.1)
Requirement already satisfied: numpy>=1.21.0 in /usr/local/lib/python3.10/dist-packages (from pandas>=1.1.0->geopandas) (1.25.2)

In [4]:
#importing Libraries
import pandas as pd
import numpy as np

In [5]:
#Read the dataframe
df=pd.read_csv("Data Cleaning with numpy and pandas - Dataset 1 (1).csv")

In [6]:
#Load the dataframe
print(df)

     Age      Salary  Rating       Location  Established Easy Apply
0   44.0   $44k-$99k     5.4       India,In         1999       TRUE
1   66.0   $55k-$66k     3.5    New York,Ny         2002       TRUE
2    NaN   $77k-$89k    -1.0    New York,Ny           -1         -1
3   64.0   $44k-$99k     4.4       India In         1988         -1
4   25.0   $44k-$99k     6.4  Australia Aus         2002         -1
5   44.0   $77k-$89k     1.4       India,In         1999       TRUE
6   21.0   $44k-$99k     0.0    New York,Ny           -1         -1
7   44.0   $44k-$99k    -1.0  Australia Aus           -1         -1
8   35.0   $44k-$99k     5.4    New York,Ny           -1         -1
9   22.0   $44k-$99k     7.7       India,In           -1       TRUE
10  55.0   $10k-$49k     5.4       India,In         2008       TRUE
11  44.0   $10k-$49k     6.7       India,In         2009         -1
12   NaN   $44k-$99k     0.0       India,In         1999         -1
13  25.0   $44k-$99k    -1.0  Australia Aus         2019       TRUE
14  66.0   $44k-$99k     4.0  Australia Aus         2020       TRUE
15  44.0  $88k-$101k     3.0  Australia Aus         1999         -1
16  19.0   $19k-$40k     4.5       India,In         1984         -1
17   NaN   $44k-$99k     5.3    New York,Ny         1943       TRUE
18  35.0   $44k-$99k     6.7    New York,Ny         1954       TRUE
19  32.0   $44k-$99k     3.3    New York,Ny         1955       TRUE
20   NaN   $44k-$99k     5.7    New York,Ny         1944       TRUE
21  35.0   $44k-$99k     5.0    New York,Ny         1946         -1
22  19.0   $55k-$66k     7.8    New York,Ny         1988       TRUE
23   NaN   $44k-$99k     2.4    New York,Ny         1999       TRUE
24  13.0   $44k-$99k    -1.0    New York,Ny         1987         -1
25  55.0   $44k-$99k     0.0  Australia Aus         1980       TRUE
26   NaN   $55k-$66k     NaN       India,In         1934       TRUE
27  52.0   $44k-$99k     5.4       India,In         1935         -1
28   NaN   $39k-$88k     3.4  Australia Aus         1932         -1

In [7]:
#checking missing values
print(df.isnull().sum())

Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [8]:
#Replace -1 with Nan for handling
df.replace(-1,np.nan, inplace = True)

In [9]:
#Handling for the missing data
df['Age'].fillna(df['Age'].median(), inplace = True)

In [10]:
def convert_salary(s):
    if isinstance(s, str):
        s = s.replace('$', '').replace('k', '').split('-')
        return (int(s[0]) + int(s[1])) / 2
    else:
        return np.nan

In [11]:
df['Salary'] = df['Salary'].apply(convert_salary)
df['Salary'].fillna(df['Salary'].mean(), inplace = True)

In [12]:
print(df[['Salary']])

    Salary
0     71.5
1     60.5
2     83.0
3     71.5
4     71.5
5     83.0
6     71.5
7     71.5
8     71.5
9     71.5
10    29.5
11    29.5
12    71.5
13    71.5
14    71.5
15    94.5
16    29.5
17    71.5
18    71.5
19    71.5
20    71.5
21    71.5
22    60.5
23    71.5
24    71.5
25    71.5
26    60.5
27    71.5
28    63.5

In [14]:
df['Rating'].fillna(df['Rating'].median(), inplace = True)

In [15]:
df['Established'].fillna(df['Established'].median(), inplace = True)
df['Easy Apply'].fillna(df['Easy Apply'].mode()[0], inplace = True) # replace with False

In [16]:
print(df)

     Age  Salary  Rating       Location  Established Easy Apply
0   44.0    71.5    5.40       India,In       1999.0       TRUE
1   66.0    60.5    3.50    New York,Ny       2002.0       TRUE
2   39.5    83.0    4.75    New York,Ny       1988.0         -1
3   64.0    71.5    4.40       India In       1988.0         -1
4   25.0    71.5    6.40  Australia Aus       2002.0         -1
5   44.0    83.0    1.40       India,In       1999.0       TRUE
6   21.0    71.5    0.00    New York,Ny       1988.0         -1
7   44.0    71.5    4.75  Australia Aus       1988.0         -1
8   35.0    71.5    5.40    New York,Ny       1988.0         -1
9   22.0    71.5    7.70       India,In       1988.0       TRUE
10  55.0    29.5    5.40       India,In       2008.0       TRUE
11  44.0    29.5    6.70       India,In       2009.0         -1
12  39.5    71.5    0.00       India,In       1999.0         -1
13  25.0    71.5    4.75  Australia Aus       2019.0       TRUE
14  66.0    71.5    4.00  Australia Aus       2020.0       TRUE
15  44.0    94.5    3.00  Australia Aus       1999.0         -1
16  19.0    29.5    4.50       India,In       1984.0         -1
17  39.5    71.5    5.30    New York,Ny       1943.0       TRUE
18  35.0    71.5    6.70    New York,Ny       1954.0       TRUE
19  32.0    71.5    3.30    New York,Ny       1955.0       TRUE
20  39.5    71.5    5.70    New York,Ny       1944.0       TRUE
21  35.0    71.5    5.00    New York,Ny       1946.0         -1
22  19.0    60.5    7.80    New York,Ny       1988.0       TRUE
23  39.5    71.5    2.40    New York,Ny       1999.0       TRUE
24  13.0    71.5    4.75    New York,Ny       1987.0         -1
25  55.0    71.5    0.00  Australia Aus       1980.0       TRUE
26  39.5    60.5    4.75       India,In       1934.0       TRUE
27  52.0    71.5    5.40       India,In       1935.0         -1
28  39.5    63.5    3.40  Australia Aus       1932.0         -1

In [17]:
#Datatypes of each Indicator
print(df.dtypes)

Age            float64
Salary         float64
Rating         float64
Location        object
Established    float64
Easy Apply      object
dtype: object

In [18]:
#Align of Datatypes
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Age          29 non-null     float64
 1   Salary       29 non-null     float64
 2   Rating       29 non-null     float64
 3   Location     29 non-null     object
 4   Established  29 non-null     float64
 5   Easy Apply   29 non-null     object
dtypes: float64(4), object(2)
memory usage: 1.5+ KB
None

In [19]:
df['Salary'] = df['Salary'].replace({'\$': '', 'k': '', ',': ''}, regex=True).astype(float)

In [20]:
outliers = {}
for col in ['Age', 'Salary', 'Rating']:
    Q1 = df[col].quantile(0.25)
    Q3 = df[col].quantile(0.75)
    IQR = Q3 - Q1
    lower_bound = Q1 - 1.5 * IQR
    upper_bound = Q3 + 1.5 * IQR
    potential_outliers = df[(df[col] < lower_bound) | (df[col] > upper_bound)]
    outliers[col] = potential_outliers
for col, potential_outliers in outliers.items():
    print(f"\n{col}:")
    print(potential_outliers)

Age:
     Age  Salary  Rating       Location  Established Easy Apply
1   66.0    60.5    3.50    New York,Ny       2002.0       TRUE
3   64.0    71.5    4.40       India In       1988.0         -1
14  66.0    71.5    4.00  Australia Aus       2020.0       TRUE
24  13.0    71.5    4.75    New York,Ny       1987.0         -1

Salary:
     Age  Salary  Rating       Location  Established Easy Apply
1   66.0    60.5    3.50    New York,Ny       2002.0       TRUE
2   39.5    83.0    4.75    New York,Ny       1988.0         -1
5   44.0    83.0    1.40       India,In       1999.0       TRUE
10  55.0    29.5    5.40       India,In       2008.0       TRUE
11  44.0    29.5    6.70       India,In       2009.0         -1
15  44.0    94.5    3.00  Australia Aus       1999.0         -1
16  19.0    29.5    4.50       India,In       1984.0         -1
22  19.0    60.5    7.80    New York,Ny       1988.0       TRUE
26  39.5    60.5    4.75       India,In       1934.0       TRUE
28  39.5    63.5    3.40  Australia Aus       1932.0         -1

Rating:
     Age  Salary  Rating       Location  Established Easy Apply
6   21.0    71.5     0.0    New York,Ny       1988.0         -1
12  39.5    71.5     0.0       India,In       1999.0         -1
25  55.0    71.5     0.0  Australia Aus       1980.0       TRUE

In [21]:
def convert(s):
  if isinstance(s, str):
    s = s.replace('$','').replace('k','').split('-')
    s_v = [float(value) for value in s]
    return np.mean(s_v)
  else:
    return s

In [22]:
df['Salary'] = df['Salary'].apply(convert)

In [23]:
print(df['Salary'])

0     71.5
1     60.5
2     83.0
3     71.5
4     71.5
5     83.0
6     71.5
7     71.5
8     71.5
9     71.5
10    29.5
11    29.5
12    71.5
13    71.5
14    71.5
15    94.5
16    29.5
17    71.5
18    71.5
19    71.5
20    71.5
21    71.5
22    60.5
23    71.5
24    71.5
25    71.5
26    60.5
27    71.5
28    63.5
Name: Salary, dtype: float64

In [24]:
#Examine the unique entries in the Location column
unique_locations = df['Location'].unique()

In [25]:
print(unique_locations)

['India,In' 'New York,Ny' 'India In' 'Australia Aus']

In [26]:
suggest = {
    "India,In": "India, IN",
    "India In": "India, IN",
    "New York,Ny": "New York, NY",
    "Australia Aus": "Australia, AUS"
}
for original, standard in suggest.items():
    print(f"{original} -> {standard}")

India,In -> India, IN
India In -> India, IN
New York,Ny -> New York, NY
Australia Aus -> Australia, AUS

In [27]:
df['Location'] = df['Location'].replace(suggest)
print(df['Location'].unique())

['India, IN' 'New York, NY' 'Australia, AUS']

In [28]:
#check distribution
print(df['Established'].describe())

count      29.000000
mean     1981.551724
std        26.409666
min      1932.000000
25%      1955.000000
50%      1988.000000
75%      1999.000000
max      2020.000000
Name: Established, dtype: float64

In [29]:
#Finding missing values
df['Established'].fillna(df['Established'].median(), inplace = True)

In [30]:
print(df['Established'])

0     1999.0
1     2002.0
2     1988.0
3     1988.0
4     2002.0
5     1999.0
6     1988.0
7     1988.0
8     1988.0
9     1988.0
10    2008.0
11    2009.0
12    1999.0
13    2019.0
14    2020.0
15    1999.0
16    1984.0
17    1943.0
18    1954.0
19    1955.0
20    1944.0
21    1946.0
22    1988.0
23    1999.0
24    1987.0
25    1980.0
26    1934.0
27    1935.0
28    1932.0
Name: Established, dtype: float64

In [31]:
print(df['Easy Apply'].dtype)
print(df['Easy Apply'].unique())
#replace -1 with Nan
df['Easy Apply'].replace(-1, np.nan, inplace=True)

object
['TRUE' '-1']

In [32]:
#missing values
df['Easy Apply'].fillna(df['Easy Apply'].mode()[0], inplace = True)
#convert to boolean
df['Easy Apply'] = df['Easy Apply'].astype(bool)
print(df['Easy Apply'])

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
21    True
22    True
23    True
24    True
25    True
26    True
27    True
28    True
Name: Easy Apply, dtype: bool

In [33]:
#description of all values
print(df['Rating'].describe())

count    29.000000
mean      4.363793
std       2.076179
min       0.000000
25%       3.400000
50%       4.750000
75%       5.400000
max       7.800000
Name: Rating, dtype: float64

In [34]:
#Finding min and max values
print(df['Rating'].min())
print(df['Rating'].max())

0.0
7.8

In [35]:
#expected min and max value range
s_min, s_max = 1, 5
#replace outlier with Nan using boolean indexes
df.loc[(df['Rating'] < s_min) | (df['Rating'] > s_max),'Rating']= np.nan
#Fill Nan values with mean column
df['Rating'].fillna(df['Rating'].mean(), inplace = True)
print(df['Rating'])

0     3.91
1     3.50
2     4.75
3     4.40
4     3.91
5     1.40
6     3.91
7     4.75
8     3.91
9     3.91
10    3.91
11    3.91
12    3.91
13    4.75
14    4.00
15    3.00
16    4.50
17    3.91
18    3.91
19    3.30
20    3.91
21    5.00
22    3.91
23    2.40
24    4.75
25    3.91
26    4.75
27    3.91
28    3.40
Name: Rating, dtype: float64

In [36]:
print(df['Age'].describe())

count    29.000000
mean     39.155172
std      13.974533
min      13.000000
25%      32.000000
50%      39.500000
75%      44.000000
max      66.000000
Name: Age, dtype: float64

In [37]:
#check for missing values
print(df['Age'].isna().sum())

0

In [38]:
#check for outliers using IQR
Q1 = df['Age'].quantile(0.25)
Q3 = df['Age'].quantile(0.75)
IQR = Q3 - Q1
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR
outlier = df[(df['Age'] < lower_bound) | (df['Age'] > upper_bound)]
print(outlier['Age'])

1     66.0
3     64.0
14    66.0
24    13.0
Name: Age, dtype: float64

In [39]:
#Filling missing values
df['Age'].fillna(df['Age'].median(), inplace=True)
#Handling outliers
df.loc[df['Age'] < lower_bound, 'Age'] = lower_bound
df.loc[df['Age'] > upper_bound, 'Age'] = upper_bound
print(df['Age'])

0     44.0
1     62.0
2     39.5
3     62.0
4     25.0
5     44.0
6     21.0
7     44.0
8     35.0
9     22.0
10    55.0
11    44.0
12    39.5
13    25.0
14    62.0
15    44.0
16    19.0
17    39.5
18    35.0
19    32.0
20    39.5
21    35.0
22    19.0
23    39.5
24    14.0
25    55.0
26    39.5
27    52.0
28    39.5
Name: Age, dtype: float64

In [40]:
print(df['Location'].unique())

['India, IN' 'New York, NY' 'Australia, AUS']

In [41]:
#present year
present_year = 2024
#To calculate date of birth
df['Date_of_Birth'] = present_year - df['Age']

In [42]:
#inconsitencies
inconsistent = (df['Date_of_Birth'] > df['Established']) & df['Date_of_Birth'].notnull() & df['Established'].notnull()
#inconsistent rows as output
inconsistent_rows = df[inconsistent]
print(inconsistent_rows[['Age', 'Date_of_Birth', 'Established']])

     Age  Date_of_Birth  Established
6   21.0         2003.0       1988.0
8   35.0         1989.0       1988.0
9   22.0         2002.0       1988.0
16  19.0         2005.0       1984.0
17  39.5         1984.5       1943.0
18  35.0         1989.0       1954.0
19  32.0         1992.0       1955.0
20  39.5         1984.5       1944.0
21  35.0         1989.0       1946.0
22  19.0         2005.0       1988.0
24  14.0         2010.0       1987.0
26  39.5         1984.5       1934.0
27  52.0         1972.0       1935.0
28  39.5         1984.5       1932.0

In [43]:
#no of inconsistent rows
no_of_inconsistent = inconsistent_rows.shape[0]
#total no of rows
total_rows = df.shape[0]
print(f"{no_of_inconsistent} out of {total_rows}")

14 out of 29

In [44]:
print(df['Easy Apply'])

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
19    True
20    True
21    True
22    True
23    True
24    True
25    True
26    True
27    True
28    True
Name: Easy Apply, dtype: bool

In [45]:
print(df['Location'])

0          India, IN
1       New York, NY
2       New York, NY
3          India, IN
4     Australia, AUS
5          India, IN
6       New York, NY
7     Australia, AUS
8       New York, NY
9          India, IN
10         India, IN
11         India, IN
12         India, IN
13    Australia, AUS
14    Australia, AUS
15    Australia, AUS
16         India, IN
17      New York, NY
18      New York, NY
19      New York, NY
20      New York, NY
21      New York, NY
22      New York, NY
23      New York, NY
24      New York, NY
25    Australia, AUS
26         India, IN
27         India, IN
28    Australia, AUS
Name: Location, dtype: object

In [46]:
print(df['Location'].unique())

['India, IN' 'New York, NY' 'Australia, AUS']

In [47]:
print(df['Rating'])

0     3.91
1     3.50
2     4.75
3     4.40
4     3.91
5     1.40
6     3.91
7     4.75
8     3.91
9     3.91
10    3.91
11    3.91
12    3.91
13    4.75
14    4.00
15    3.00
16    4.50
17    3.91
18    3.91
19    3.30
20    3.91
21    5.00
22    3.91
23    2.40
24    4.75
25    3.91
26    4.75
27    3.91
28    3.40
Name: Rating, dtype: float64

In [48]:
df = pd.read_csv('Data Cleaning with numpy and pandas - Dataset 2.csv')

In [49]:
print(df)

      order_id  quantity                              item_name  \
0            1         1           Chips and Fresh Tomato Salsa
1            1         1                                   Izze
2            1         1                       Nantucket Nectar
3            1         1  Chips and Tomatillo-Green Chili Salsa
4            2         2                           Chicken Bowl
...        ...       ...                                    ...
4617      1833         1                          Steak Burrito
4618      1833         1                          Steak Burrito
4619      1834         1                     Chicken Salad Bowl
4620      1834         1                     Chicken Salad Bowl
4621      1834         1                     Chicken Salad Bowl

                                     choice_description item_price
0                                                   NaN      $2.39
1                                          [Clementine]      $3.39
2                                               [Apple]      $3.39
3                                                   NaN      $2.39
4     [Tomatillo-Red Chili Salsa (Hot), [Black Beans...     $16.98
...                                                 ...        ...
4617  [Fresh Tomato Salsa, [Rice, Black Beans, Sour ...     $11.75
4618  [Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...     $11.75
4619  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...     $11.25
4620  [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...      $8.75
4621  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...      $8.75

[4622 rows x 5 columns]

In [50]:
#finding unique values
print(df['quantity'].unique())

[ 1  2  3  4  5 15  7  8 10]

In [51]:
#for counting no of values
print(df['quantity'].count())

4622

In [52]:
#count quantity of each item
print(df['quantity'].value_counts())

quantity
1     4355
2      224
3       28
4       10
5        1
15       1
7        1
8        1
10       1
Name: count, dtype: int64

In [53]:
print(df['choice_description'].count())
#count of each item
print(df['choice_description'].value_counts())

3376
choice_description
[Diet Coke]                                                                                                                                      134
[Coke]                                                                                                                                           123
[Sprite]                                                                                                                                          77
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Lettuce]]                                                                            42
[Fresh Tomato Salsa, [Rice, Black Beans, Cheese, Sour Cream, Guacamole, Lettuce]]                                                                 40
                                                                                                                                                ...
[Fresh Tomato Salsa (Mild), [Pinto Beans, Black Beans, Rice, Cheese, Sour Cream, Lettuce]]                                                         1
[[Fresh Tomato Salsa (Mild), Roasted Chili Corn Salsa (Medium), Tomatillo-Red Chili Salsa (Hot)], [Pinto Beans, Cheese, Sour Cream, Lettuce]]      1
[Fresh Tomato (Mild), [Guacamole, Rice, Black Beans]]                                                                                              1
[[Tomatillo-Green Chili Salsa (Medium), Tomatillo-Red Chili Salsa (Hot)], [Black Beans, Rice, Cheese, Lettuce]]                                    1
[Tomatillo Green Chili Salsa, [Rice, Fajita Vegetables, Black Beans, Guacamole]]                                                                   1
Name: count, Length: 1043, dtype: int64

In [54]:
#most repeated item
print(df['choice_description'].value_counts().idxmax())
#most repeated items count
print(df['choice_description'].value_counts().max())

[Diet Coke]
134

In [55]:
#total no of items
print(df['quantity'].sum())

4972

In [56]:
#count of unique items
print(df['item_name'].nunique())

50

In [57]:
#Total revenue
df['item_price'] = df['item_price'].replace({'\$':''}, regex = True).astype(float)
revenue = (df['item_price'] * df['quantity']).sum()
print(revenue)

39237.02

In [58]:
#Total orders
print(df['order_id'].count())

4622

In [59]:
#Average reveune
mean_item = df['item_price'].mean()
df['item_price'].fillna(mean_item, inplace = True)
print(df['item_price'])

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [60]:
#unique items are sold
print(df['item_name'].unique())
print(df['item_name'].nunique())

['Chips and Fresh Tomato Salsa' 'Izze' 'Nantucket Nectar'
 'Chips and Tomatillo-Green Chili Salsa' 'Chicken Bowl' 'Side of Chips'
 'Steak Burrito' 'Steak Soft Tacos' 'Chips and Guacamole'
 'Chicken Crispy Tacos' 'Chicken Soft Tacos' 'Chicken Burrito'
 'Canned Soda' 'Barbacoa Burrito' 'Carnitas Burrito' 'Carnitas Bowl'
 'Bottled Water' 'Chips and Tomatillo Green Chili Salsa' 'Barbacoa Bowl'
 'Chips' 'Chicken Salad Bowl' 'Steak Bowl' 'Barbacoa Soft Tacos'
 'Veggie Burrito' 'Veggie Bowl' 'Steak Crispy Tacos'
 'Chips and Tomatillo Red Chili Salsa' 'Barbacoa Crispy Tacos'
 'Veggie Salad Bowl' 'Chips and Roasted Chili-Corn Salsa'
 'Chips and Roasted Chili Corn Salsa' 'Carnitas Soft Tacos'
 'Chicken Salad' 'Canned Soft Drink' 'Steak Salad Bowl'
 '6 Pack Soft Drink' 'Chips and Tomatillo-Red Chili Salsa' 'Bowl'
 'Burrito' 'Crispy Tacos' 'Carnitas Crispy Tacos' 'Steak Salad'
 'Chips and Mild Fresh Tomato Salsa' 'Veggie Soft Tacos'
 'Carnitas Salad Bowl' 'Barbacoa Salad Bowl' 'Salad' 'Veggie Crispy Tacos'
 'Veggie Salad' 'Carnitas Salad']
50